back/app/controllers/movies_controller.rb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`movie_id` = 'tt2331047' ORDER BY id desc
SELECT `users`.`username`, `users`.`picture`, `users`.`provider` FROM `users` WHERE `users`.`id` = 10
SELECT `users_favs`.* FROM `users_favs` WHERE `users_favs`.`movie_id` = 'tt2331047' AND `users_favs`.`uid` = 10
---
  def Movie
    unless params[:id]
      render json: ['status' => false, 'message' => t('bad_req')], :status=> 400
    else
      content =  MoviesHelper.findMovie(params[:id])
      unless content
        render json: ['status' => false, 'message' => t('bad_req')]
      else
        response = HTTParty.get("https://api.themoviedb.org/3/movie/" + content['id'].to_s + "?append_to_response=videos,credits&api_key=" + ENV['apikey_moviedb'] + "&language=" + ApplicationHelper.getLanguage + "&page=1")
        unless response.code == 200
          render json: { 'status' => false, 'message' => t('bad_req')}
        else
          @user = current_user
          result = JSON.parse(response.body)
          result['users_com'] = {}
          result['comment'] = Review.where(movie_id: params[:id]).order('id desc')
          if result['comment']
            result['comment'].each do |elem|
              # result['users_com'][elem.uid] = User.select(:username, :picture, :provider).where(id: elem.uid)
              result['users_com'][elem.uid.to_s] = User.select(:username, :picture, :provider).where(id: elem.uid)
            end
          end
          result['subtitles'] = SubtitltesHelper.searchSubtitle(params[:id])
          result['fav'] = Users_favs.where(movie_id: params[:id]).where(uid: @user[:id]).length

INSERT INTO `users_favs` (`uid`, `movie_id`, `created_at`, `updated_at`) VALUES (32, 'tt0119225', '2017-12-13 13:03:46', '2017-12-13 13:03:46')
---
  def new_fav
    @user = current_user
    @fav = Users_favs.create(uid: @user[:id], movie_id: params[:fav][:movie_id])

SELECT  `users_favs`.* FROM `users_favs` WHERE `users_favs`.`uid` = 15 AND `users_favs`.`movie_id` = 'tt6622186' LIMIT 1
DELETE FROM `users_favs` WHERE `users_favs`.`id` = 36
---
  def delete_fav
    @user = current_user
    @favd = Users_favs.find_by(uid: @user[:id], movie_id: params[:fav][:movie_id])
    @favd.destroy

SELECT  `users_views`.* FROM `users_views` WHERE `users_views`.`uid` = 32 AND `users_views`.`torrent_id` = '3CDEF50476D64912F8C3CAEA9F38325481A7F7CB' AND `users_views`.`movie_id` = 'tt0119225' ORDER BY `users_views`.`id` ASC LIMIT 1
INSERT INTO `users_views` (`uid`, `torrent_id`, `movie_id`, `datetime`) VALUES (15, '083443954F5BEEC6A7D61D0A63D31B0E5D9DA71A', 'tt6622186', '2017-12-14 10:42:43')
UPDATE `users_views` SET `time_elapsed` = 2908 WHERE `users_views`.`id` = 75
---
  def viewedFilm
    @user = current_user
    request_params = params.require(:view).permit(:movie_id, :time, :torrent_id)

    @view = Users_view.where(uid: @user.id, torrent_id: request_params[:torrent_id], movie_id: request_params[:movie_id]).first
    unless @view
      Users_view.new(uid: @user.id, torrent_id: request_params[:torrent_id], movie_id: request_params[:movie_id], time_elapsed: request_params[:time], datetime: Time.now).save

SELECT  `users_auths`.* FROM `users_auths` WHERE `users_auths`.`token` = 'Xdm5QQ61h5Fz92YhAKPF1diKqwLxacqxFqzZKTQbvyZNLg62DkubeF4ptfpRpV1WDvFNJK5BRdsK8hEZH8dqfgGFVybB2bH1FSvo' AND `users_auths`.`download` = 1 ORDER BY `users_auths`.`id` ASC LIMIT 1
---
  def torrent
    request_params = params.require(:token)

    torrent = Users_auth.where(token: request_params, download: 1).first

SELECT  `users_auths`.* FROM `users_auths` WHERE `users_auths`.`token` = 'Xdm5QQ61h5Fz92YhAKPF1diKqwLxacqxFqzZKTQbvyZNLg62DkubeF4ptfpRpV1WDvFNJK5BRdsK8hEZH8dqfgGFVybB2bH1FSvo' AND `users_auths`.`stream` = 1 ORDER BY `users_auths`.`id` ASC LIMIT 1
SELECT  `torrents`.* FROM `torrents` WHERE `torrents`.`torrent_id` = '3CDEF50476D64912F8C3CAEA9F38325481A7F7CB' ORDER BY `torrents`.`id` ASC LIMIT 1
---
  def torrentStream
    request_params = params.require(:token)

    torrent = Users_auth.where(token: request_params, stream: 1).first
    unless torrent
      render json: [ 'status' => false, 'message' => t('bad_req')], :status=> 400
    else
      # torrent.update_attribute(:active, 0)
      hash = ActiveSupport::JSON.decode(torrent.torrent_data)
      @file = Torrent.where(torrent_id: hash['torrent_id']).first