back/app/controllers/pages_controller.rb

INSERT INTO `reviews` (`uid`, `message`, `created_at`, `updated_at`, `movie_id`) VALUES (15, '  00', '2017-12-14 10:42:34', '2017-12-14 10:42:34', 'tt6622186')
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`movie_id` = 'tt6622186' ORDER BY id desc
SELECT `users`.`username`, `users`.`picture`, `users`.`provider` FROM `users` WHERE `users`.`id` = 15
---
  def new_review
    @user = current_user
    review_params = params.require(:review).permit(:message)
    review_params[:movie_id] = params[:review][:movie_id]
    review_params[:uid] = @user[:id]
    @review = Review.new(review_params)

    if @review.valid?
      @review.save
      @getreview = Review.where(movie_id: params[:review][:movie_id]).order('id desc')
      @getuser = User.select(:username, :picture, :provider).where(id: @user.id)