back/app/controllers/profiles_controller.rb

  def view
    unless request.params
      render json: {'status' => false, 'message' => t('profile_nfound')}, :status=> 400
    end

    @getuser = User.find_by_username(request.params['username'])
    unless @getuser
      render json: {'status' => false, 'message' => t('profile_nfound')}, :status=> 400
    else
      @fav =  Users_favs.where(uid: @getuser['id']).order('created_at desc')
      @review = Review.where(uid: @getuser['id'])
      @viewedfilm = Users_view.where(uid: @getuser['id']).order('id desc')
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'aaleksov' LIMIT 1
SELECT `users_favs`.* FROM `users_favs` WHERE `users_favs`.`uid` = 10 ORDER BY created_at desc
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`uid` = 10
SELECT `users_views`.* FROM `users_views` WHERE `users_views`.`uid` = 10 ORDER BY id desc