back/app/controllers/sessions_controller.rb

  def create
    user_params = params.require(:user)

    @user = User.where(username: user_params[:username], provider: nil).first

    if @user and @user.authenticate(user_params[:password])
     @session = SessionsHelper.createSession(@user)
     render json: {'status' => true, 'token' => @session.token, 'user' => User.select(:username, :email, :firstname, :lastname, :picture, :provider).find_by(id: @session.uid)}, :status=> 200
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'aaleksov' AND `users`.`provider` IS NULL ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `users`.`username`, `users`.`email`, `users`.`firstname`, `users`.`lastname`, `users`.`picture`, `users`.`provider` FROM `users` WHERE `users`.`id` = 34 LIMIT 1

  def remove
    user_log = Users_log.where(uid: current_user_not_protected['id'], token: request.headers['Authorization']).first
    unless user_log
      render json: {'status' => true, 'message' => t('token_nfound')}
    else
      user_log.update_attribute(:status, false)
---
UPDATE `users_logs` SET `status` = 0 WHERE `users_logs`.`id` = 180

  def omniauth
    if auth_hash && auth_hash['info']['email'] && auth_hash['provider']
      @user = User.where(email: auth_hash['info']['email'], provider: auth_hash['provider']).first
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'videau.antoine@outlook.fr' AND `users`.`provider` = 'amazon' ORDER BY `users`.`id` ASC LIMIT 1

  def r_marvin
    client = OAuth2::Client.new('aa698d1c7b888c2445f5ce20874049e095c4e0a47dfbe9125d3fc3e9debf611b', '35fb88f50dd5f08de82e0bd2298d40324d7e0ac36a6c69f045f9deba85d98683', :site => 'https://api.intra.42.fr/oauth/token')

    begin
      token = client.auth_code.get_token(params[:code], :redirect_uri => 'http://localhost:8999/auth/marvin/r_callback')

      response = token.get('/v2/me')
      if response.status == 200
        auth_hash = Hash.new()
        auth_hash['email'] = response.parsed['email']
        auth_hash['firstname'] = response.parsed['first_name']
        auth_hash['lastname'] = response.parsed['last_name']
        auth_hash['image'] = response.parsed['image_url']
        auth_hash['provider'] = 'marvin'


        @user = User.where(email: auth_hash['email'], provider: auth_hash['provider']).first
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'aaleksov@student.42.fr' AND `users`.`provider` = 'marvin' ORDER BY `users`.`id` ASC LIMIT 1