back/app/controllers/torrents_controller.rb

SELECT  `users_auths`.* FROM `users_auths` WHERE `users_auths`.`token` = 'Xdm5QQ61h5Fz92YhAKPF1diKqwLxacqxFqzZKTQbvyZNLg62DkubeF4ptfpRpV1WDvFNJK5BRdsK8hEZH8dqfgGFVybB2bH1FSvo' AND `users_auths`.`stream` = 1 ORDER BY `users_auths`.`id` ASC LIMIT 1
INSERT INTO `torrents` (`torrent_id`) VALUES ('3CDEF50476D64912F8C3CAEA9F38325481A7F7CB')
SELECT  `torrents`.* FROM `torrents` WHERE `torrents`.`torrent_id` = '3CDEF50476D64912F8C3CAEA9F38325481A7F7CB' LIMIT 1
UPDATE `torrents` SET `path` = 'Gridlock\'d (1997) [YTS.AG]/Gridlock\'d.1997.720p.BluRay.x264-[YTS.AG].mp4' WHERE `torrents`.`id` = 70
---
  def addTorrent
    token = params.require(:token)
    filesize = params.require(:filesize)
    path = params.require(:path)
    completed = params.require(:completed)

    torrent = Users_auth.where(token: token, stream: 1).first
    unless torrent
      render json: [ 'status' => false, 'message' => t('bad_req')], :status=> 400
    else

      data = JSON.parse(torrent.torrent_data)

      @result = Torrent.find_or_create_by(torrent_id: data['torrent_id'])
      @result.update_attribute(:filesize, filesize)