back/app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `email`, `lastname`, `firstname`, `password_digest`, `picture`, `created_at`, `updated_at`, `recover_password`) VALUES ('coucou', 'itsme@42.fr', 'lol', 'dd', '$2a$10$sXKe7LrBmtFvIp98F3KqHuU4MFBZbaNItke14Mn6Jm2cs7ZAsyIkS', 'http://localhost:8999/api/Users/coucou/image.png', '2017-12-14 10:51:34', '2017-12-14 10:51:34', 'QovXpJbkxVnL3qdNxtAYoD2F')
---
  def create
    user_params = params.permit(:username, :email, :firstname, :lastname, :password, :password_confirmation, :picture_file)

    @user = User.new(user_params)
    unless user_params[:picture_file]
      render json: {'status' => false, 'errors' =>  ['0': 'wrong image']}, :status=> 202
    else
      @user.recover_password = nil
        if @user.valid?
          @user.save

UPDATE `users` SET `picture` = 'http://localhost:8999/api/Users/alekalek-na8xbnbnk/image.png', `updated_at` = '2017-12-07 13:59:32' WHERE `users`.`id` = 20
---
  def picture
    @user = current_user_not_protected

    user_params = params.require(:picture_file)

    if @user.update_attribute(:picture_file, user_params)

UPDATE `users` SET `lastname` = '--', `updated_at` = '2017-12-14 10:49:39' WHERE `users`.`id` = 15
---
  def data
    @user = current_user_not_protected

    user_params = params.require(:user).permit(:email, :lastname, :firstname)

    if @user.update(user_params)

UPDATE `users` SET `language` = 'fr', `updated_at` = '2017-12-07 12:40:14' WHERE `users`.`id` = 10
---
  def language
    @user = current_user_not_protected
    if @user
      user_params = params.require(:user).permit(:language)
      if user_params[:language] == 'fr' || user_params[:language] == 'en'
        @user.update_attribute(:language, user_params[:language])

UPDATE `users` SET `password_digest` = '$2a$10$hGUPg0vBnnzoPn0IpmckPu5SiGekhIkM84nDg1LMidcyuXdzfq/D2', `updated_at` = '2017-12-14 10:52:50' WHERE `users`.`id` = 34
---
  def updatepassword
    @user = current_user_not_protected

    user_params = params.require(:user).permit(:password, :password_confirmation)
    user_password = params.require(:user).permit(:current_password)

    unless @user.try(:authenticate, user_password[:current_password])
      render json: {'status' => false, 'message' => t('err'), 'errors' =>  ['0': 'wrong password1']}, :status=> 202
    else
      if user_params['password'].length == 0 || user_params['password_confirmation'].length == 0
        render json: {'status' => false, 'message' => t('err'), 'errors' =>  ['0': 'wrong password2']}, :status=> 202
      else
        if @user.update(user_params)